package bkrs

import "testing"

func TestCleanBkrsLine(t *testing.T) {
	tests := []struct {
		term     string
		expected string
	}{
		{" \n[m1]сесть на мель[/m]", "сесть на мель"},
		{"располагать\\[ся\\]", "располагать[ся]"},
		{
			" [m1]1) 《诗‧小雅》篇名。[/m][m1]2) 喻丈夫之恩惠。[/m][m1]3) 浓重的露水。[/m]",
			"1) 《诗‧小雅》篇名。\n2) 喻丈夫之恩惠。\n3) 浓重的露水。",
		},
		{
			"[m1]1) Шаньси ([i]провинция в КНР[/i])[/m][m1]2) Шонтэй, Шонтай ([i]вьетнамский топоним[/i])[/m][m2][*][ex]山西市社 город (административные единица первого порядка) Шонтэй[/ex][/*][/m][m2][*][ex]山西省 провинция Шонтэй ([i]в 1965 году объединена с провинцией Хадонг[/i])[/ex][/*][/m]",
			"1) Шаньси (провинция в КНР)\n2) Шонтэй, Шонтай (вьетнамский топоним)",
		},
		{
			"[m1]1) золото[/m][m2][*][ex]金兰之友 побратимы, закадычные друзья[/ex][/*][/m][m2][*][ex]结金兰 завязать крепкую дружбу; стать побратимами[/ex][/*][/m][m1]2) пыльцеголовник[/m][m1]3) Камрань[/m]",
			"1) золото\n2) пыльцеголовник\n3) Камрань",
		},
	}
	cleaner := makeCleaner(true)

	for _, testCase := range tests {
		result := CleanBkrsLine(testCase.term, cleaner)

		if result != testCase.expected {
			t.Errorf("Incorrect result. Expect %s, got %s", testCase.expected, result)
		}
	}
}
